#------------------------------------------------------------------------------
# 日本語の設定
#------------------------------------------------------------------------------
export LANG=ja_JP.UTF-8

#------------------------------------------------------------------------------
# ターミナルの色設定
#------------------------------------------------------------------------------
export CLICOLOR=1
export TERM=xterm-256color

# LSCOLORSのデフォルト値（exfxcxdxbxegedabagacad）
export LSCOLORS=gxfxcxdxbxegedabagacad
# このサイトでLSCOLORSをLS_COLORSに変換（https://geoff.greer.fm/lscolors/）
export LS_COLORS="di=36:ln=35:so=32:pi=33:ex=31:bd=34;46:cd=34;43:su=30;41:sg=30;46:tw=30;42:ow=30;43"

#------------------------------------------------------------------------------
# ヒストリ設定
#------------------------------------------------------------------------------
# 履歴ファイルの保存先
export HISTFILE=~/.zsh_history
# メモリに保存される履歴件数
HISTSIZE=10000
# HISTFILEで指定したファイルに保存される履歴件数
SAVEHIST=100000
# ディレクトリスタックの件数
DIRSTACKSIZE=30
